{
  "plant1": {
    "image": "https://www.anniesannuals.com/signs/a/images/aster_oblonigifolius_05.jpg",
    "name": "Symphyotrichum oblongifolium: Aromatic Aster",
    "size": "1ft tall - 3ft wide",
    "sun": "Full sun to part shade",
    "color": "Purple",
    "description": "Easily grown in average, to dry to medium, well-drained soil in full sun. It does well in sandy or clay soils. Generally tolerating poor soils and drought. It's blooms from August to September. Birds, bees and butterflies all love Aster, and so do gardeners! It's a fantastic ground cover with a noticeable perfume. Zones 3-8."
  },
  "plant2": {
    "image": "https://www.edenbrothers.com/store/media/Seeds-Flowers/resized/SFCON111-1_medium.jpg",
    "name": "Echinacea purpurea: Coneflower",
    "size": "2ft tall - 4ft wide",
    "sun": "Full sun to part shade",
    "color": "Purple-ish",
    "description": "The Coneflower produces big and bright flowers (in a variety of colors) from late June until Frost. These plants thrive in average soils, can withstand hot and dry conditions and don't mind the cold. Coneflowers are good when it comes to supplying butterflies, bees and even birds with a supply of food. To further it's uses, the Coneflower is a well known for immune system support. The Coneflower is a herbaceous perennial, which means it will die during the winter but will grow back during the spring."
  },
  "plant3": {
    "image": "https://millpondplants.files.wordpress.com/2012/01/lobelia-cardinalis-3.jpg",
    "name": "Lobelia cardinalis: Lobelia",
    "size": "2ft tall - 3ft wide",
    "sun": "Morning Sun",
    "color": "Red",
    "description": "Easily grown in medium to wet soils; though, needs constant moisture. Tolerates brief flooding and appreciates some afternoon shade in the hotter periods of the year. Dried out soil is not Lobelia's friend and often it's killer. Lobelia's bell shaped blooms vary from red, blue and white. It attracts bees and butterflies, yet as a pleasant addition, it also attracts hummingbirds. Lobelia is a herbaceous perennial, meaning it will die during the winter but grow back during the spring. Zones 3-9."
  },
  "plant4": {
    "image": "http://images.mobot.org/PlantRecords1/prod/large960/00080000/80965.jpg",
    "name": "Asclepias incarnata: Swamp Milkweed",
    "size": "5ft tall - 3 or 4ft wide ",
    "sun": "Full Sun",
    "color": "Pink",
    "description": "Milkweed is one of the Monarch's favorite plants. Not only is it food, it's considered a host plant (where the butterfly creates it's chrysalis). Milkweed has pink to mauve to white flowers. It's easy to grow in medium to wet soils in full sun. Have a ditch that you want to add some spizazz to? Plant some Milkweed and see it take off. Milkweed is a herbaceous perennial that will die during the winter but regrow in the spring. Zones 3-6."
  },
  "plant5": {
    "image": "https://www.provenwinners.com/sites/provenwinners.com/files/imagecache/500x500/ifa_upload/lantana_luscious_royale_cosmo_tag_0.jpg",
    "name": "Lantana camara: Lantana",
    "size": "Anywhere from 4ft tall - 4ft wide",
    "sun": "Full Sun",
    "color": "Varies",
    "description": "Lantana is an annual with a multitude of cultivars. The shrubby like plant wildly flashes it's blooms in yellows, pinks, oranges, reds, purples and whites. Lantana is notorious for attract butterflies and bees of all kinds. It's drought tolerant and easy to grow. Once it becomes established, it's a plant that you can accidentally forget about and it not die on you. Lantana is an annual, so it will have to be planted every spring. If you are in a warmer zone, it's quite possible that Lantana will will resume growth again in the spring. Zones roughly 7-10. "
  }
}