{
  "plant1": {
    "image": "http://i66.tinypic.com/kbu8gg.jpg",
    "scientificName": "Symphyotrichum oblongifolium",
    "name": "Aromatic Aster",
    "size": "0.50ft -1ft T & W",
    "icon": "1",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Purple",
    "description": "Easily grown in average, to dry to medium, well-drained soil in full sun. It does well in sandy or clay soils. Generally tolerating poor soils and drought. It's blooms from August to September. Birds, bees and butterflies all love Aster, and so do gardeners! It's a fantastic ground cover with a noticeable perfume. Zones 3-8."
  },
  "plant2": {
    "image": "http://i63.tinypic.com/2jebdhw.jpg",
    "scientificName": "Echinacea purpurea",
    "name": "Coneflower",
    "size": "1-3ft T, 1-3ft W",
    "icon": "4",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Purple, Pink, Red, Orange, White",
    "description": "The Coneflower produces big and bright flowers (in a variety of colors) from late June until Frost. These plants thrive in average soils, can withstand hot and dry conditions and don't mind the cold. Coneflowers are good when it comes to supplying butterflies, bees and even birds with a supply of food. To further it's uses, the Coneflower is a well known for immune system support. The Coneflower is a herbaceous perennial, which means it will die during the winter but will grow back during the spring."
  },
  "plant3": {
    "image": "http://i68.tinypic.com/29nzg2f.jpg",
    "scientificName": "Lobelia cardinalis",
    "name": "Cardinal Lobelia",
    "size": "1-3ft T, 0.50-1ft W",
    "icon": "2",
    "life": "Perennial",
    "sun": "Part Sun",
    "color": "Red",
    "description": "Easily grown in medium to wet soils; though, needs constant moisture. Tolerates brief flooding and appreciates some afternoon shade in the hotter periods of the year. Dried out soil is not Lobelia's friend and often it's killer. Lobelia's bell shaped blooms vary from red, blue and white. It attracts bees and butterflies, yet as a pleasant addition, it also attracts hummingbirds. Lobelia is a herbaceous perennial, meaning it will die during the winter but grow back during the spring. Zones 3-9."
  },
  "plant4": {
    "image": "http://i66.tinypic.com/2drs47c.jpg",
    "scientificName": "Asclepias incarnata",
    "name": "Swamp Milkweed",
    "size": "1-5ft T, 1-4ft W",
    "icon": "4",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Light Pink",
    "description": "Milkweed is one of the Monarch's favorite plants. Not only is it food, it's considered a host plant (where the butterfly creates it's chrysalis). Milkweed has pink to mauve to white flowers. It's easy to grow in medium to wet soils in full sun. Have a ditch that you want to add some spizazz to? Plant some Milkweed and see it take off. Milkweed is a herbaceous perennial that will die during the winter but regrow in the spring. Zones 3-6."
  },
  "plant5": {
    "image": "http://i66.tinypic.com/347tels.jpg",
    "scientificName": "Asclepias curassavica",
    "name": "Butterfly Weed",
    "size": "2-3ft T, 1-2ft W",
    "icon": "4",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Red, Yellow, Orange",
    "description": "This is a common Milkweed, also known as Scarlet Weed, Bloodflower or Mexican Milkweed. Butterfly Weed is a good drought tolerant plant; however, it will grow better in moister conditions. Showy blooms will consistently grow and show throughout the entire seasons before it dies back for the winter. A plus for this plant is that it is deer and rabbit resistant. However, if you have pets that like to chew on plants, any Milkweed is not a viable choice. The plant contains a sappy white goo that is toxic. Aphids also really like Milkweed, which is a bothersome pest. They will not hurt the plant - as in it won't die on you - but it is annoying and ugly. When you don't have any eggs or any chrysalis on the plant, you can spray the aphids with a mixture of dish detergent soap and water. Just check thoroughly that there are no eggs, it will kill them just as it will the aphids. Zones 8a-11."
  },
  "plant6": {
    "image": "https://www.provenwinners.com/sites/provenwinners.com/files/imagecache/500x500/ifa_upload/lantana_luscious_royale_cosmo_tag_0.jpg",
    "scientificName": "Lantana camara: Lantana",
    "name": "Lantana",
    "size": "1-2ft T, 1-3ft W",
    "icon": "2",
    "life": "Annual",
    "sun": "Full Sun",
    "color": "All",
    "description": "Lantana is an annual with a multitude of cultivars. The shrubby like plant wildly flashes it's blooms in yellows, pinks, oranges, reds, purples and whites. Lantana is notorious for attract butterflies and bees of all kinds. It's drought tolerant and easy to grow. Once it becomes established, it's a plant that you can accidentally forget about and it not die on you. Lantana is an annual, so it will have to be planted every spring. If you are in a warmer zone, it's quite possible that Lantana will will resume growth again in the spring. Zones roughly 7-10. "
  },
  "plant7": {
    "image": "http://i66.tinypic.com/16j527s.jpg",
    "name": "Meadow Blazing Star",
    "scientificName": "Liatris ligulistylis",
    "size": "4-6ft T, 1-2ft W",
    "icon": "5",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Purple, Blue",
    "description": "BLazing star blooms late in the summer. Most plants bloom early spring to mid summer, so this plant is a good consideration for your garden. The blooms also last for up to 6 weeks! The Blazing Star is also pest resistant, which makes handling much easier. Overwatering is a no no with this plant. Unfortunately this plant is not commonly sold in nurseries, so you may have to buy it by seed. If that's the case, start seeds inside before the final frost arrives. In the spring, divide the plants up and plant away. Since these plants can grow very tall, staking will be necessary for height. Butterflies like the height! Zones 3-8."
  },
  "plant8": {
    "image": "http://i67.tinypic.com/24lrajb.jpg",
    "name": "Alyssum (all varieties)",
    "scientificName": "Lobularia",
    "size": "6-10 inches T, varies",
    "icon": "1",
    "life": "Annual",
    "sun": "Full Sun",
    "color": "Purple, Blue, White",
    "description": "Alyssum is a fantastic annual for ground cover and pots. Put it in a hanging pot with other annuals, like Pentas or Lantana, and watch the butterflies and bees come. Alyssum comes in many different colors, such as pink, white, lavender or purple. For an annual, it's surprisingly cold hardy and can wistand the 40's and 50's F. It is important to make sure to water when the plant is dry. Don't wait too long or the blooms will fall off. If it's in a potted plant, it is especially important to make sure that it does not dry out."
  },
  "plant9": {
    "image": "http://i68.tinypic.com/153xhzd.jpg",
    "name": "Beebalms (all varieties)",
    "scientificName": "Lobularia",
    "size": "2.5-4ft T, 18-36 inches W",
    "icon": "4",
    "life": "Perennial",
    "sun": "Full Sun",
    "color": "Purple, Orange, Red, Pink",
    "description": "Beebalm is a fast grower, great for the eager gardener. They do require adequate spacing, however. If you want a smaller cultivar, there are other varieties of Beebalm. It is in the mint family, which means that it will spread! It's a plant that is good for larger beds. Beebalm does not need to dry out. It will weaken the plant and unfortunately die. Mulch around the base of the plant will help retain moisture. This is not a good plant for wet and humid conditions. Beebalm unfortunately attracts Powdery Mildew easily. I do not suggest spraying it, unless you are using a natural and organic fungicide. Still be careful on the timing - don't hit your bees! Any pesticide that enters a bloom will kill the bee or insect that drinks the nectar. It's best to cut off the infected areas and let it go. Well ventilated plants do the best and there are other cultivars that resist better. Zones 4-9."
  },
  "plant10": {
    "image": "http://i63.tinypic.com/2rhojs0.jpg",
    "name": "Calendula",
    "scientificName": "Calendula officinalis",
    "size": "1-2ft T, 1-2ft W",
    "icon": "2",
    "life": "Annual",
    "sun": "Full Sun",
    "color": "All",
    "description": "Calendula is an easily grown annual that appreciates well-drained soils that is moderately fertile. If the zone is rather hot, they do appreciate some part shade in the afternoon. However, if they have too much shade, Calendula will become leggy. Many gardeners use Calendula as a pest trapper plant. It's sticky sap traps many pests, such as aphids. Hey... this would be a good plant to have near your Milkweed! As well, it's used for many different medical means. Calendula is a good plant for smaller gardens or pot gardens. They grow easily in a container. Zones 2-11."
  },
  "plant11": {
    "image": "http://i63.tinypic.com/1jxpuv.jpg",
    "name": "Delphinium",
    "scientificName": "Delphinium (all varieties)",
    "size": "3-5ft T, 2-3ft W",
    "icon": "4",
    "life": "Perennial",
    "sun": "Part Sun",
    "color": "Blue, Pink, Purple, White",
    "description": "Delphiniums are beautiful and a favorite for gardeners, but can be hard to grow for beginners. They do not like hot and dry weather, preferring moise and cool summers. They do not like sudden wind or rain, so planting them in an area that will help shelter them is advised. Taller cultivars will also need to be staked. If you have pets that like to chew on plants, it's important to plant away from them or not at all. Very young Delphinium plants and seeds are poisonous. If ingested, it can cause nausea, twitching muscles, paralysis and even death. Woah! Be careful! However, this plant attracts a multitude of butterflies and hummingbirds.  Zones 3-7."
  },
  "plant12": {
    "image": "http://i63.tinypic.com/24g62dh.jpg",
    "name": "Dianthus",
    "scientificName": "Dianthus (all varieties)",
    "size": "0.25-0.50ft T, 0.50-1ft W",
    "life": "Perennial",
    "icon": "1",
    "sun": "Full Sun",
    "color": "All",
    "description": "Dianthus, also called Sweet William (Dianthus barbatus) is easily grown in average, medium and well drained soil. There are many different varieties of Dianthus. Most are evergreen and can be low-growing annuals, biennials or perennials. Many are used as natural borders along gardens and in pots. It's important to dead head this plant because of it's multitude of flowers and to encourage more blooms. This is tedious work, so for gardeners that do not want to spend time pruning, it may be one to avoid. Zones 3-8."
  },
  "plant13": {
    "image": "http://i65.tinypic.com/jzxqfo.jpg",
    "name": "Fennel",
    "scientificName": "Foeniculum vulgare",
    "size": "4-6ft T, 1.50-3ft W",
    "life": "Perennial",
    "icon": "5",
    "sun": "Full Sun",
    "color": "Yellow",
    "description": "Fennel does best in moise, organically rich and well drained soils. A very important factor with Fennel to note is it's spreading quality. This is again a plant that is best to either be planted to go wild, or cover a large area. If you're dedicated to keeping the plant contained, then it will not be a problem. Fennel self seeds. A lot. Good thing, though, is that the yellow flowers attract butterflies, especially some Swallowtail varieties that use it as a larval plant. Zones 4-9."
  },
  "plant14": {
    "image": "http://i65.tinypic.com/2pqj5p3.jpg",
    "name": "Showy Goldenrod",
    "scientificName": "Solidago speciosa",
    "size": "2-3ft T (but can reach 5-7ft T), 2-3ft W",
    "life": "Perennial",
    "icon": "4",
    "sun": "Full Sun",
    "color": "Yellow",
    "description": "Showy Goldenrod is a native to Tennessee. Often this plant is seen in fields in waves of gold, meaning that it's rather drought tolerant. Goldenrod is a favorite to the Monarch; though, all butterflies and bees love this perennial. It is an easy plant to grow, so for a beginner this is one to choose. Within a couple of years, it should be divided to control growth. There are many different cultivars of Goldenrod, as well. Whatever your need may be, Goldenrod may provide. Goldenrod will provide ecosystem services to your Butterfly and Bee area well into the fall when most other plant life is shutting down. It was actually blamed for Hay fever, too. This is untrue, as it's pollen does not cause any sinus issues. Zones 3-8."
  },
  "plant15": {
    "image": "http://i65.tinypic.com/ncictv.jpg",
    "name": "Lavender",
    "scientificName": "Lavandula angustifolia",
    "size": "1-2ft T, 1-2ft W",
    "life": "Evergreen Perennial",
    "icon": "2",
    "sun": "Full Sun",
    "color": "Lavender, Purple",
    "description": "Lavandula angustifolia is also called English Lavendar, or Munstead. Lavender is a bees best friend. And a bee is Lavender's best friend, as it needs a bee to pollinate, as Lavender has both female and male parts. If you want to attract all kinds of little buzzing buddies, Lavender is the plant to choose. Many varieties of Lavender are twice blooming or bloom throughout the entire spring and summer. It thrives in heat and drought. This particular cultivar is more moisture tolerant and cold hardy than other varieties. This makes it a great garden plant for Tennessee. Zones 4-10."
  },
  "plant16": {
    "image": "http://i66.tinypic.com/r24y8j.jpg",
    "name": "Pincushion Flower",
    "scientificName": "Scabiosa",
    "size": "1-1.50ft T, 1-1.50ft W",
    "life": "Perennial",
    "icon": "2",
    "sun": "Full Sun",
    "color": "Blue",
    "description": "Scabiosa is commonly called the Pincushion flower. This particular cultivar, 'Butterfly Blue' is a compact and clump forming perennial which typically only grows 12-15 inches tall. It blooms long, from April until frost. These plants are excellent for grouping, borders and rock gardens. It's easily grown in average and well drained soil. It does tolerate part shade, too, in the deep South where it gets very hot. It is especially intolerant to wet soils, especially in the winter. There are other varieties of the Pincushion flower, even as annuals. They come in other colors, such as white and purple. If you choose to grow Scabiosa as an annual, they range in further colors such as maroon, lavender-blue, rose, pink and white. Zones 5-10."
  },
  "plant17": {
    "image": "http://i68.tinypic.com/1ghamg.jpg",
    "name": "Shasta Daisy",
    "scientificName": "Leucanthemum × superbum 'Becky'",
    "size": "3-4ft T, 2-3ft W",
    "life": "Perennial",
    "icon": "4",
    "sun": "Full Sun",
    "color": "White",
    "description": "The cultivar 'Becky' is larger than most and also has a long period of blooming. They are very easy to grow, not having an issue with dryer temperatures once it has been established. They do not like to be in moister soils, as root rot can be a problem. 'Becky' and other Shastas grow fast, which is definitely a plus for new gardens. Plants are, however, somewhat short-lived. You may want to trim back the stems to the basal leaves after flowering to try to prolong life. Like coneflowers, they will clump and begin to spread over time. It may be necessary to divide them after a couple of years, unless it's what you want. These in comination with coneflowers and Rudebeckia will call forth many bees. Zones 5 to 9."
  },
  "plant18": {
    "image": "http://i65.tinypic.com/2ps1s1e.jpg",
    "name": "Verbena",
    "scientificName": "Verbena officinalis",
    "size": "0.25-40.50ft T, varies W",
    "life": "Annual",
    "icon": "1",
    "sun": "Full Sun",
    "color": "All",
    "description": "In my opinion and from first hand use and observation, Verbena is one of the best butterfly attractions you could ask for. Not only is it one of the prettiest annuals you can buy, all kinds of butterflies are attracted to this low growing annual. Verbena comes in a variety of all kinds of colors, from salmon, pink, hot pink, red, white, purple, lavender and variegated kinds such as red and white. The majority and most common verbena are low growers, known as 'spillers' in the garden community as far as potted plants go. It's gorgeous as an addition to your front porch, a hanging basket, or in the ground as a cover. Verbena is a drought tolerant plant to an extent. However in a pot it is trickier and if the plant dries out entirely, the blooms will fall off. It's also especially important to trim off the old blooms to encourage more to grow. Verbena will grow for you the entire season if you do this and Zones 5 to 9."
  },
  "plant19": {
    "image": "http://i68.tinypic.com/izt6jb.jpg",
    "name": "Snapdragon",
    "scientificName": "Antirrhinum majus",
    "size": "15-48inches T, 15-30inches W",
    "life": "Annual",
    "icon": "1",
    "sun": "Full Sun",
    "color": "All",
    "description": "Snapdragons are named after their notable and fun bloom. If you pull gently on the bottom bloom near the opening, it 'snaps' back. Chomp! Because of this, Snapdragons rely heavily on Bumble Bees for pollination. Snapdragons are a main hostplant for Buckeye Butterfly. This means that the mother Butterfly will lay her eggs on the Snapdragons. It is a very common plant, so nurseries should have this plant in the early spring and summer. They come in all sorts of colors and range in size. They may pause during the heat and slow down on the blooming, but if you keep them watered they will bloom again closer to fall. Sometimes they will come back the next year, too. Zones 7 to 9."
  },
  "plant20": {
    "image": "http://i67.tinypic.com/r86xba.jpg",
    "name": "Black Eyed Susans",
    "scientificName": "Rudbeckia",
    "size": "1-9ft T, varies W",
    "life": "Perennial",
    "icon": "5",
    "sun": "Full Sun",
    "color": "Yellow",
    "description": "Black Eyed Susans are hardy plants that grow fast and spread. They are great for big gardens and for attracting bees. Many people plant this alongside Coneflowers. There are many different varieties of this plant, ranging from dwarfs that are around 1 foot to very large ones, like 'Toto' that can be up to 9 feet. Black Eyed Susans are fine with drier soils, not liking to be moist consistently. Like Shasta Daisy's, they will acquire root rot if they stay wet. Once they are established, they will be a very low maintenance plant. They will spread; however, so this will need a larger area to grow. It may be necessary to divide them some after a couple of years. Though with dwarven cultivars, that may not be necessary. Go light on the fertilizer - it will produce weak stems if it has too much. Zones 4 to 9."
  },
  "plant21": {
    "image": "http://i66.tinypic.com/2z7mtyf.jpg",
    "name": "Spicebush",
    "scientificName": "Lindera benzoin",
    "size": "6-12ft T, varies W",
    "life": "Deciduous shrub",
    "icon": "5",
    "sun": "Shade",
    "color": "Yellow",
    "description": "The Spicebush plant is a host plant for the Spicebush Swallowtail. These look very similiar to the Eastern Black Swallowtail. It is also a host plant to the Eastern Tiger Swallowtail and the Silkmoth. Spicebush is a large and beautiful shrub that has glossy green leaves that turn yellow during the fall times. It has pretty and frilly like yellow blooms that happen on bare branches. Most people call it the wild 'Forsythia'. Spicebush also produces bright red berries. These berries attract birds. It's a fast growing shrub that likes moist and shady places. Though, a small amount of sun yields a bush with better form amd more berries. Teas can be made out of the leaves and twigs, and the ground up dried berries can be used as a spice, hence it's name! Zones 4 to 9."
  },
  "plant22": {
    "image": "http://i66.tinypic.com/n6cjr6.jpg",
    "name": "Tulip Poplar",
    "scientificName": "Liriodendron tulipifera",
    "size": "70-90ft T, 30-35ft W",
    "life": "Deciduous tree",
    "icon": "6",
    "sun": "Full Sun",
    "color": "Yellow",
    "description": "The Tulip Poplar is one of my favorite trees! It is also one of the tallest hardwood trees in Tenenssee and Kentucky. It's also the state tree for us in TN. In May and June, the Poplar tree blooms striking yellow and orange flowers. The leaves come out folded and yellow, growing green with age, only to turn yellow again in the autumn. The Poplar tree is a very large tree, and in the wild could get up to 150ft tall! As great as it is to have in your yard for shade and beauty, the Poplar tree is a great host plant for the Tiger Swallowtail. You'll find Tigers frolicking in your tree before you know it. They are a little sensitive to drought, however, so during the hotter periods during the first couple of years, it's important to set a slow dripping hose at the base of the tree for an hour or two. Zones 4 and up."
  },
  "plant23": {
    "image": "http://i67.tinypic.com/28br39v.jpg",
    "name": "Passion Vine",
    "scientificName": "Passiflora caerulea",
    "size": "Varies, vine",
    "life": "Perennial vine",
    "icon": "5",
    "sun": "Full Sun",
    "color": "Purple, Blue, White, Red",
    "description": "The Passion Vine is a beautiful one, with exotic purple, white and blue flowers. The complex blooms of the Passion Flower are host and nectar plants to more than one butterfly. The Gulf Fritillary and Zebra Longwing love to lay their eggs on this winding vine. With good sunlight, heat and humidity, this vine will be trainable to windows, trellises or any other area you'd like it to climb. If you do take it inside for the winter, just make sure that you prune it heavily after flowering. The blooms will appear in Early to late summer. The vine can easily be planted in the ground, or you could leave it in a pot. However, depending on how big of a plant you would like, it's best to plant it in the ground. Zones 6 to 9."
  },
  "plant24": {
    "image": "http://i67.tinypic.com/14aki7r.jpg",
    "name": "Petunia",
    "scientificName": "Petunia",
    "size": "0.75-1ft T, 1-3ft W",
    "life": "Annual",
    "icon": "1",
    "sun": "Full Sun",
    "color": "All",
    "description": "Petunia's are a very popular annual plant. They attract many different insects for nectar, such as bees, butterflies and hummingbird moths. They come in a range of different colors, from pastels to bright and bolds, and they can be used in all sorts of arrangements. Most of the time, the gardener will use them in potted plants. They are good spillers, and will do well in a hanging plant or just by itself. The petunia does need to be regularly deadheaded, however, which can be a little bit time consuming. If you like the look of the Petunia, but do not want the deadheading mess, many prefer Callies. They will bloom the entire season up until the first frost. Petunias are also a host plant to the Tiger Swallowtail. They are also a bee's favorite! They are pretty low maintenance, though need regular feeding and sometimes need a heavy cutback in the hotter moments. Zones 10 to 11."
  },
  "plant25": {
    "image": "http://i63.tinypic.com/14nzsj6.jpg",
    "name": "Parsley",
    "scientificName": "Petroselinum crispum",
    "size": "0.75-2ft T, 1-2ft W",
    "life": "Reseeding Perennial",
    "icon": "2",
    "sun": "Full Sun",
    "color": "White",
    "description": "Parsley is one of the Eastern Black Swallowtail's favorite host plant, besides Dill. The female butterfly will lay eggs on the plant and the caterpillar will hatch and eat on the herb until it's ready to roam and chrysalis. The Parsley plant is a reseeding perennial, if you let it be. Though, until your caterpillars are done, it's a good idea to cut off the flower heads to prevent that reseeding. If you let the flower go to reseeding, it will then grow lanky and the foliage will stop developing. That is not good for the development of baby caterpillars! Though, it is a good idea, if you want the plant to come back, to at least have one dill plant reseed, or perhaps one head. Parsley has a variety of kinds, as well, such as flat leave or curly. Either one will work as a host plant. It is suggested to plant Parsley alongside Dill for even better caterpillar growth. Zones 4 to 9."
  },
  "plant26": {
    "image": "",
    "name": "Dill",
    "scientificName": "Anethum graveolens",
    "size": "0.75-2ft T, 1-2ft W",
    "life": "Reseeding Perennial",
    "icon": "2",
    "sun": "Full Sun",
    "color": "Yellow",
    "description": "Dill is a fragrant herb that is one of the favorite hosts for Eastern Swallowtail Butterflies. It's a fluffy plant with soft, thin leaves. If you rub your hands and fingers against it gently, you'll be able to smell it's familiar scent. Dill has pretty yellow flowers if you let it seed. Unfortunately, when you let the flowers grow, the plant will grow leggy and skinny. The foliage will no longer bee the main priority. If you do let the flowers continue, it will seed and more dill plants will grow. Most gardeners let the dill seed towards the end of the season so it will come back in the following spring. "
  }
}